InformationRegisters/ТелеграмНастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмНастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаПользователя1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЧата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграмНастройкиПользователей/Ext/ManagerModule.bsl
Функция ПолучитьСоставНастроек() Экспорт
	
	СоставНастроек = Новый Структура;
	СоставНастроек.Вставить("НастройкаПользователя1", "НастройкаПользователя1");
	Возврат СоставНастроек;
	
КонецФункции


Функция ПолучитьНастройкиПользователя(ИдентификаторЧата) Экспорт
	
	НастройкиПользователя = Новый Структура;
	
	СоставНастроек = ПолучитьСоставНастроек();
	Если ИдентификаторЧата = Неопределено Тогда
		Для Каждого КлючИЗначение ИЗ СоставНастроек Цикл
			НастройкиПользователя.Вставить(КлючИЗначение.Значение, Неопределено);
			Возврат НастройкиПользователя;
		КонецЦикла;
	КонецЕсли;
	
	// Сборка текста запроса
	ТекстЗапроса = "";
	Для Каждого КлючИЗначение Из СоставНастроек Цикл
		Если ТекстЗапроса <> "" Тогда
			ТекстЗапроса = ТекстЗапроса + "," + Символы.ПС;
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "Р." + КлючИЗначение.Ключ + " КАК " + КлючИЗначение.Значение;
	КонецЦикла;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|" + ТекстЗапроса + "
	|ИЗ РегистрСведений.ТелеграмНастройкиПользователей КАК Р
	|ГДЕ Р.ИдентификаторЧата = &ИдентификаторЧата";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторЧата", ИдентификаторЧата);
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Для Каждого КлючИЗначение ИЗ СоставНастроек Цикл
			НастройкиПользователя.Вставить(КлючИЗначение.Значение, Неопределено);
			Возврат НастройкиПользователя;
		КонецЦикла;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Для Каждого КлючИЗначение Из СоставНастроек Цикл
			НастройкиПользователя.Вставить(КлючИЗначение.Значение, Выборка[КлючИЗначение.Ключ]);
		КонецЦикла;
	КонецЕсли;
	
	Возврат НастройкиПользователя;
	
КонецФункции
